# Import Packages

In [52]:
import numpy as np 
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

### detect Problem

In [53]:
path = "Uber_Dataset.csv"

In [54]:
uber_data = pd.read_csv(path)
uber_data.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/16 21:11,1/1/16 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/16 1:25,1/2/16 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/16 20:25,1/2/16 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/16 17:31,1/5/16 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/16 14:42,1/6/16 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

### First Problem: We should correct the date format because it's wrong.

In [55]:
uber_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1155 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [56]:
uber_data.describe()

            MILES*
count  1155.000000
mean     10.566840
std      21.579106
min       0.500000
25%       2.900000
50%       6.000000
75%      10.400000
max     310.300000

In [57]:
uber_data.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [58]:
uber_data.shape

(1155, 7)

In [59]:
uber_data.isnull()

      START_DATE*  END_DATE*  CATEGORY*  START*  STOP*  MILES*  PURPOSE*
0           False      False      False   False  False   False     False
1           False      False      False   False  False   False      True
2           False      False      False   False  False   False     False
3           False      False      False   False  False   False     False
4           False      False      False   False  False   False     False
...           ...        ...        ...     ...    ...     ...       ...
1150        False      False      False   False  False   False     False
1151        False      False      False   False  False   False     False
1152        False      False      False   False  False   False     False
1153        False      False      False   False  False   False     False
1154        False      False      False   False  False   False     False

[1155 rows x 7 columns]

In [60]:
uber_data.isnull().sum()

START_DATE*      0
END_DATE*        0
CATEGORY*        0
START*           0
STOP*            0
MILES*           0
PURPOSE*       502
dtype: int64

### Second Problem: There are a lot of null or missing values in the PURPOSE column.

In [61]:
uber_data.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1150    False
1151    False
1152    False
1153    False
1154    False
Length: 1155, dtype: bool

In [62]:
uber_data.duplicated().sum()

np.int64(1)

### Third Problem: There is a duplicate value.

In [66]:
uber_data.nunique()

START_DATE*    1154
END_DATE*      1154
CATEGORY*         2
START*          177
STOP*           188
MILES*          256
PURPOSE*         11
dtype: int64

### Summary of Problems:

    First Problem: We should correct the date format because it's wrong.
    Second Problem: There are a lot of null or missing values in the PURPOSE column.
    Third Problem: There is a duplicate value.